Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: The 'winheight' option can be set to a minimal desired height of a window and 'winminheight' to a hard minimum height. Likewise, there is 'winwidth' for the minimal desired width and 'winminwidth' for the hard minimum width. The 'equalalways' option, when set, makes Vim equalize the windows sizes when a window is closed or opened.
es_es: La opción 'winheight' se puede ajustar a una altura mínima de ventana y 'winminheight' a un mínimo estricto. Del mismo modo, hay un ancho 'winwidth' para el ancho mínimo deseado y un 'winminheight' para un ancho mínimo estricto. La opción 'equalalways', cuando está activa, hace que Vim equilibre el tamaño de las ventanas cuando éstas se cierran o se abren nuevas.

source: *08.4* Vertical splits
es_es: *08.4* Divisiones verticales

source: The ":split" command creates the new window above the current one. To make the window appear at the left side, use: >
es_es: La orden «:split» crea una nueva ventana sobre la actual. Para hacer que una ventana aparezca en el lateral izquierda, use: >

source: or: > :vsplit two.c
es_es: o: > :vsplit two.c

source: +--------------------------------------+ |/* file two.c */ |/* file one.c */ | |~ |~ | |~ |~ | |~ |~ | |two.c===============one.c=============| | | +--------------------------------------+
es_es: +--------------------------------------+ |/*archivo dos.c */ |/*archivo uno.c */| |~ |~ | |~ |~ | |~ |~ | |two.c===============one.c=============| | | +--------------------------------------+

source: There is also the ":vnew" command, to open a vertically split window on a new, empty file. Another way to do this: >
es_es: También hay una orden «:vnew», para abrir una partición vertical con un archivo nuevo. Otra forma de hacer esto es la siguiente: >

source: The ":vertical" command can be inserted before another command that splits a window. This will cause that command to split the window vertically instead of horizontally. (If the command doesn't split a window, it works unmodified.)
es_es: La orden «:vertical» se puede insertar justo antes de otra orden que divida la ventana. Esto puede hacer que la ventana se divida verticalmente en lugar de horizontalmente. (Si la orden no divide ventanas se ejecuta de modo normal.)

source: Since you can split windows horizontally and vertically as much as you like, you can create almost any layout of windows. Then you can use these commands to move between them:
es_es: Ya que puede dividir ventanas horizontal y verticalmente a voluntad, puede crear casi cualquier estructura. Una vez las haya creado se puede desplazar por ellas:

source: CTRL-W h move to the window on the left CTRL-W j move to the window below CTRL-W k move to the window above CTRL-W l move to the window on the right
es_es: CTRL-W h moverse a la ventana de la izquierda CTRL-W j moverse a la ventana de abajo CTRL-W k moverse a la ventana de arriba CTRL-W l moverse a la ventana de la derecha

source: CTRL-W t move to the TOP window CTRL-W b move to the BOTTOM window
es_es: CTRL-W t moverse a la ventana superior (TOP) CTRL-W b moverse a la ventana inferior (BOTTOM)

source: You will notice the same letters as used for moving the cursor. And the cursor keys can also be used, if you like. More commands to move to other windows: |Q_wi|.
es_es: Se habrá dado cuenta de que son las mismas teclas empleadas para mover el cursor. También puede usar las teclas de flechas si lo desea. Más órdenes para moverse a otras ventanas: |Q_wi|.

source: *08.5* Moving windows
es_es: *08.5* Mover ventanas

source: You have split a few windows, but now they are in the wrong place. Then you need a command to move the window somewhere else. For example, you have three windows like this:
es_es: Imagine que ha creado unas cuantas ventanas, pero están en el lugar equivocado. Necesitará una orden para mover las ventanas a otro lugar. Por ejemplo, tiene tres ventanas como estas:

source: +----------------------------------+ |/* file two.c */ | |~ | |~ | |two.c=============================| |/* file three.c */ | |~ | |~ | |three.c===========================| |/* file one.c */ | |~ | |one.c=============================| | | +----------------------------------+
es_es: +----------------------------------+ |/* archivo dos.c */ | |~ | |~ | |dos.c=============================| |/* archivo tres.c */ | |~ | |~ | |tres.c============================| |/* archivo uno.c */ | |~ | |uno.c=============================| | | +----------------------------------+

source: Clearly the last one should be at the top. Go to that window (using CTRL-W w) and the type this command: >
es_es: Obviamente la última ventana debería estar en la parte superior. Vaya a esa ventana (usando CTRL-W w) y luego teclee la siguiente orden: >

source: +-------------------------------------------+ |/* two.c */ |/* three.c */ |/* one.c */ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |two.c=========three.c=========one.c========| | | +-------------------------------------------+
es_es: +-------------------------------------------+ |/* dos.c */ |/* tres.c */ |/* uno.c */ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |dos.c==========tres.c=========uno.c========| | | +-------------------------------------------+

source: +-------------------------------------------+ |/* three.c */ | |~ | |~ | |three.c====================================| |/* two.c */ |/* one.c */ | |~ |~ | |two.c==================one.c===============| | | +-------------------------------------------+
es_es: +-------------------------------------------+ |/* tres.c */ | |~ | |~ | |tres.c=====================================| |/* dos.c */ |/* uno.c */ | |~ |~ | |dos.c==================uno.c===============| | | +-------------------------------------------+

source: CTRL-W H move window to the far left CTRL-W J move window to the bottom CTRL-W L move window to the far right
es_es: CTRL-W H mover la ventana al extremo izquierdo CTRL-W J mover la ventana al extremo inferior CTRL-W L mover la ventana al extremo derecho

source: *08.6* Commands for all windows
es_es: *08.6* Órdenes sobre todas las ventanas

source: When you have several windows open and you want to quit Vim, you can close each window separately. A quicker way is using this command: >
es_es: Cuando tiene varias ventanas abiertas y quiere salir de Vim, puede cerrar cada ventana por su cuenta. Una forma más rápida es la siguiente: >

source: This stands for "quit all". If any of the windows contain changes, Vim will not exit. The cursor will automatically be positioned in a window with changes. You can then either use ":write" to save the changes, or ":quit!" to throw them away.
es_es: Esto viene de «quit all» (cerrar todo). Si alguna de las ventanas contiene cambios, Vim no saldrá. El cursor se pondrá automáticamente en la ventana con cambios. Puede usar «:w» para guardar los cambios, o «:q!» para eliminarlos completamente.

source: This stands for "write all". But actually, it only writes files with changes. Vim knows it doesn't make sense to write files that were not changed. And then there is the combination of ":qall" and ":wall": the "write and quit all" command: >
es_es: Esto viene de «write all» (escribir/guardar todo). Pero, de hecho, sólo escribe archivos con cambios. Vim sabe que no tiene sentido guardar archivos sin cambios. También hay una combinación de «:qall» y «:wall»: la orden «guardar y salir de todas las ventanas»: >

source: This writes all modified files and quits Vim. Finally, there is a command that quits Vim and throws away all changes: >
es_es: Esto guarda todos los archivos modificados y sale de Vim. Por último, hay una orden que sale de Vim y no guarda nada: >

source: vim -o one.txt two.txt three.txt
es_es: vim -o uno.txt dos.txt tres.txt

source: +-------------------------------+ |file one.txt | |~ | |one.txt========================| |file two.txt | |~ | |two.txt========================| |file three.txt | |~ | |three.txt======================| | | +-------------------------------+
es_es: +-------------------------------+ |archivo uno.txt | |~ | |uno.txt========================| |archivo dos.txt | |~ | |dos.txt========================| |archivo tres.txt | |~ | |tres.txt=======================| | | +-------------------------------+

source: The "-O" argument is used to get vertically split windows. When Vim is already running, the ":all" command opens a window for each file in the argument list. ":vertical all" does it with vertical splits.
es_es: El argumento «-O"» se usa para que las divisiones se hagan verticalmente. Cuando Vim está ejecutándose, la orden «:all» abre una ventana para cada archivo en la lista de argumentos. «:vertical all» lo hace verticalmente.

source: *08.7* Viewing differences with vimdiff
es_es: *08.7* Ver las diferencias con «vimdiff»

source: There is a special way to start Vim, which shows the differences between two files. Let's take a file "main.c" and insert a few characters in one line. Write this file with the 'backup' option set, so that the backup file "main.c~" will contain the previous version of the file. Type this command in a shell (not in Vim): >
es_es: Existe una manera especial de arrancar Vim que muestra las diferencias entre dos archivos. Cojamos un archivo «main.c» e insertemos unos caracteres en una línea. Escriba el archivo con la opción 'backup' activada, de manera que el archivo «main.c~» contendrá la versión anterior. Escribe la siguiente orden en una consola (no en Vim): >

source: Vim will start, with two windows side by side. You will only see the line in which you added characters, and a few lines above and below it.
es_es: Vim arrancará con dos ventanas verticales. Verá solamente la línea en la que ha añadido los cambios y unas cuántas líneas por debajo.

source: VV VV +-----------------------------------------+ |+ +--123 lines: /* a|+ +--123 lines: /* a| <- fold | text | text | | text | text | | text | text | | text | changed text | <- changed line | text | text | | text | ------------------| <- deleted line | text | text | | text | text | | text | text | |+ +--432 lines: text|+ +--432 lines: text| <- fold | ~ | ~ | | ~ | ~ | |main.c~==============main.c==============| | | +-----------------------------------------+
es_es: VV VV +-----------------------------------------+ |+ +--123 lines: /* a|+ +--123 lines: /* a| <- pliegue | texto | texto | | texto | texto | | texto | texto | | texto | texto modificado | <- línea modificada | texto | texto | | texto | ------------------| <- línea eliminada | texto | texto | | texto | texto | | texto | texto | |+ +--432 lines:texto|+ +--432 lines:texto| <- pliegue | ~ | ~ | | ~ | ~ | |main.c~==============main.c==============| | | +-----------------------------------------+

source: The lines that were not modified have been collapsed into one line. This is called a closed fold. They are indicated in the picture with "<- fold". Thus the single fold line at the top stands for 123 text lines. These lines are equal in both files. The line marked with "<- changed line" is highlighted, and the inserted text is displayed with another color. This clearly shows what the difference is between the two files. The line that was deleted is displayed with "---" in the main.c window. See the "<- deleted line" marker in the picture. These characters are not really there. They just fill up main.c, so that it displays the same number of lines as the other window.
es_es: Las líneas que no se modificaron se han agrupado en una sola línea. A esto se le denomina pliegue (fold) cerrado. Se indican con «<- pliegue» en la figura. La línea de arriba marca que hay 123 líneas. Estas líneas son iguales en ambos archivos. La línea marcada con «<- línea modificada» está resaltada y el texto insertado se muestra con otro color. Esto muestra claramente las diferencias entre los dos archivos. La línea que se eliminó se muestra con «---» en la ventana «main.c». Observe el «<- línea eliminada» en la figura. Estos caracteres no están ahí realmente. Simplemente llenan el espacio necesario en «main.c» para que ambos archivos tengan el mismo número de líneas.

source: Each window has a column on the left with a slightly different background. In the picture above these are indicated with "VV". You notice there is a plus character there, in front of each closed fold. Move the mouse pointer to that plus and click the left button. The fold will open, and you can see the text that it contains. The fold column contains a minus sign for an open fold. If you click on this -, the fold will close. Obviously, this only works when you have a working mouse. You can also use "zo" to open a fold and "zc" to close it.
es_es: Cada ventana tiene una columna en la izquierda que tiene un fondo ligeramente diferente. En la figura de arriba se indican con «VV». Fíjese que hay un carácter «+» en ese sitio, enfrente de cada pliegue cerrado. Mueva el puntero del ratón a ese signo «+» y pulse el botón izquierdo. Esto abrirá el pliegue, mostrando el texto que contiene. La columna del pliegue muestra un «-» para un pliegue abierto. Si pulsa este «-», el pliegue se cerrará. Obviamente, esto sólo funciona cuando tiene un ratón configurado. También puedes usar «zo» para abrir un pliegue y «zc» para cerrarlo.

source: Another way to start in diff mode can be done from inside Vim. Edit the "main.c" file, then make a split and show the differences: >
es_es: Otra manera de iniciar el modo diff es hacerlo desde Vim. Edite el archivo «main.c», haga después un «split» y muestre las diferencias: >

source: The ":vertical" command is used to make the window split vertically. If you omit this, you will get a horizontal split.
es_es: La orden «:vertical» se usa para hacer que las ventanas se dividan verticalmente. Si omite esto, obtendrá una división horizontal.

source: If you have a patch or diff file, you can use the third way to start diff mode. First edit the file to which the patch applies. Then tell Vim the name of the patch file: >
es_es: Si tiene un parche o un archivo diff, puede usarlo como una tercera manera de iniciar el modo diff. Primero edite el archivo sobre el cuál se aplica el parche. Entonces escribe la siguiente orden: >

source: WARNING: The patch file must contain only one patch, for the file you are editing. Otherwise you will get a lot of error messages, and some files might be patched unexpectedly. The patching will only be done to the copy of the file in Vim. The file on your harddisk will remain unmodified (until you decide to write the file).
es_es: AVISO: El parche debe contener un solo parche, el del archivo que está editando. En caso contrario, recibirá muchos de mensajes de error y algunos archivos pueden verse parcheados de forma imprevista. El parcheo será realizado sólo sobre una copia del archivo en Vim. El archivo del disco duro no se modificará hasta que no lo guardes.

source: When the files have more changes, you can scroll in the usual way. Vim will try to keep both the windows start at the same position, so you can easily see the differences side by side. When you don't want this for a moment, use this command: >
es_es: Cuando los archivos tienen muchos cambios, puede desplazarse de manera normal. Vim intentará hacer que ambas ventanas comiencen con el mismo desplazamiento, para que pueda ver las diferencias en cada lado. Cuando no quiera que esto ocurra, use lo siguiente: >

source: When you have disabled folding in some way, it may be difficult to find the changes. Use this command to jump forward to the next change: >
es_es: Cuando haya desactivado los pliegues de algún modo, puede ser más difícil encontrar los cambios. Use esta orden para saltar al siguiente cambio: >

source: You can move text from one window to the other. This either removes differences or adds new ones. Vim doesn't keep the highlighting updated in all situations. To update it use this command: >
es_es: Puede mover texto de una ventana a otra. Esto elimina diferencias o añade unas nuevas. Vim no mantiene el texto resaltado en todas las situaciones. Para actualizarlo deberá escribir: >

source: To remove a difference, you can move the text in a highlighted block from one window to another. Take the "main.c" and "main.c~" example above. Move the cursor to the left window, on the line that was deleted in the other window. Now type this command: >
es_es: Para eliminar una diferencia, puede mover el texto de un bloque resaltado desde una ventana a otra. Suponga el «main.c» y el «main.c~» del ejemplo. Mueva el cursor a la izquierda de la ventana, sobre la línea que se eliminó en la otra ventana. Ahora escriba esta orden: >

source: The change will be removed by putting the text of the current window in the other window. "dp" stands for "diff put". You can also do it the other way around. Move the cursor to the right window, to the line where "changed" was inserted. Now type this command: >
es_es: El cambio se eliminará poniendo el texto de la ventana actual en la otra ventana. «dp» viene de «diff put» (put = poner). Puede hacerlo también de la forma completamente opuesta. Mueva el cursor a la ventana de la derecha, donde se insertó el cambio. Escriba: >

source: The change will now be removed by getting the text from the other window. Since there are no changes left now, Vim puts all text in a closed fold. "do" stands for "diff obtain". "dg" would have been better, but that already has a different meaning ("dgg" deletes from the cursor until the first line).
es_es: El cambio será ahora eliminado obteniendo el texto desde la otra ventana. Ya que no hay cambios restantes, Vim pondrá todo el texto en un pliegue cerrado. «do» viene de «diff obtain» (obtain = obtener). «dg» podría ser mejor (de g = get = obtener) pero «dgg» ya tenía un significado diferente.

source: *08.8* Various
es_es: *08.8* Varios

source: 0 never 1 only when there are split windows (the default) 2 always
es_es: 0 nunca 1 sólo cuando hay más ventanas (predeterminado) 2 siempre

source: Many commands that edit another file have a variant that splits the window. For Command-line commands this is done by prepending an "s". For example: ":tag" jumps to a tag, ":stag" splits the window and jumps to a tag. For Normal mode commands a CTRL-W is prepended. CTRL-^ jumps to the alternate file, CTRL-W CTRL-^ splits the window and edits the alternate file.
es_es: Muchas órdenes que editan otro archivo disponen de una variante que divide la ventana. Para los de la línea de órdenes se hace con el prefijo «s». Por ejemplo «:tag» salta a una etiqueta, «:stag» divide la ventana y salta a la etiqueta. Para órdenes del modo normal se teclea CTRL-W antes. CTRL-^ salta al archivo alterno, CTRL-W CTRL-^ divide la ventana y edita el archivo alterno.

source: The 'splitbelow' option can be set to make a new window appear below the current window. The 'splitright' option can be set to make a vertically split window appear right of the current window.
es_es: Puede activar la opción 'splitbelow' para hacer que la nueva ventana aparezca debajo de la actual. Puede activar la opción 'splitright' para hacer que una partición vertical aparezca a la derecha de la ventana actual.

source: :leftabove {cmd} left or above the current window :aboveleft {cmd} idem :rightbelow {cmd} right or below the current window :belowright {cmd} idem :topleft {cmd} at the top or left of the Vim window :botright {cmd} at the bottom or right of the Vim window
es_es: :leftabove {cmd} izquierda o encima de la actual :aboveleft {cmd} ídem :rightbelow {cmd} derecha o debajo de la actual :belowright {cmd} ídem :topleft {cmd} encima o a la izquierda de la ventana de Vim :botright {cmd} debajo o a la derecha de la ventana de Vim

source: *08.9* Tab pages
es_es: *08.9* Pestañas

source: You will have noticed that windows never overlap. That means you quickly run out of screen space. The solution for this is called Tab pages.
es_es: Habrá notado que las ventanas no se superponen. Esto significa que puede rápidamente acabar sin espacio suficiente. La solución son las pestañas:

source: Assume you are editing "thisfile". To create a new tab page use this command: >
es_es: Suponga que está editando «estearchivo». Para crear una nueva pestaña: >

source: :tabedit thatfile
es_es: :tabedit «aquélarchivo»

source: This will edit the file "thatfile" in a window that occupies the whole Vim window. And you will notice a bar at the top with the two file names:
es_es: Esto editará el archivo «aquélarchivo» en una ventana que ocupe todo el espacio de Vim. Verá que hay una nueva barra en la parte superior:

source: +----------------------------------+ | thisfile | /thatfile/ __________X| (thatfile is bold) |/* thatfile */ | |that | |that | |~ | |~ | |~ | | | +----------------------------------+
es_es: +----------------------------------+ | estearchivo | /aquélarchivo/ ___X| (aquélarchivo está en | | negrita) |/* aquélarchivo */ | |aquél | |aquél | |~ | |~ | |~ | | | +----------------------------------+

source: You now have two tab pages. The first one has a window for "thisfile" and the second one a window for "thatfile". It's like two pages that are on top of eachother, with a tab sticking out of each page showing the file name.
es_es: Ahora tiene dos pestañas. La primera tiene una ventana para «estearchivo» y la segunda para «aquélarchivo». Es como dos páginas una encima de la otra, con una pestaña sobresaliendo de cada página.

source: +----------------------------------+ | /thisfile/ | thatfile __________X| (thisfile is bold) |/* thisfile */ | |this | |this | |~ | |~ | |~ | | | +----------------------------------+
es_es: +----------------------------------+ | /estearchivo/ | aquélarchivo ___X| (estearchivo está en | | negrita) |/* estearchivo */ | |este | |este | |~ | |~ | |~ | | | +----------------------------------+

source: Thus you can switch between tab pages by clicking on the label in the top line. If you don't have a mouse or don't want to use it, you can use the "gt" command. Mnemonic: Goto Tab.
es_es: De este modo puede pasar entre pestañas pulsando sobre la etiqueta de la línea superior. Si no dispone del ratón o no lo quiere usar, puede emplear la orden «gt». Nemotecnia: Goto Tab (ir a pestaña).

source: +-------------------------------------+ | thisfile | /thisfile/ | thatfile __X| (thisfile is bold) |/* thisfile */ | |this | |this | |~ | |~ | |~ | | | +-------------------------------------+
es_es: +----------------------------------------------+ | estearchivo | /estearchivo/ | aquélarchivo _X| (estearchivo está |/* estearchivo */ | en negrita) |este | |este | |~ | |~ | |~ | | | +----------------------------------------------+

source: You can put ":tab" before any Ex command that opens a window. The window will be opened in a new tab page. Another example: >
es_es: Puede poner «:tab» antes de cualquier orden «Ex» que abra una ventana. La ventana se abrirá en una nueva ventana. Otro ejemplo: >

source: - click with the mouse on the "X" in the top right corner The current tab page will be closed. Unless there are unsaved changes in the current tab page.
es_es: - pulse con el ratón sobre la «X» en la esquina superior derecha. La pestaña actual se cerrará a menos que haya cambios sin guardar en la pestaña.

source: - double click with the mouse in the top line A new tab page will be created.
es_es: - doble pulsación con el ratón sobre la línea superior Se creará una nueva ventana.

source: *usr_02.txt* For Vim version 7.3. Last change: 2010 Jul 20
es_es: *usr_02.esx* Para Vim versión 7.3. Último cambio: 20/6/2010

source: The first steps in Vim
es_es: Primeros pasos en Vim
